china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32l433/src/cpu_peri_uart.c
//----------------------------------------------------
// Copyright (c) 2014, SHENZHEN PENGRUI SOFT CO LTD. All rights reserved.

// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:

// 1. Redistributions of source code must retain the above copyright notice,
//    this list of conditions and the following disclaimer.
// 2. Redistributions in binary form must reproduce the above copyright notice,
//    this list of conditions and the following disclaimer in the documentation
//    and/or other materials provided with the distribution.

// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//-----------------------------------------------------------------------------
// Copyright (c) 2014 著作权由深圳鹏瑞软件有限公司所有。著作权人保留一切权利。
//
// 这份授权条款，在使用者符合下列条件的情形下，授予使用者使用及再散播本
// 软件包装原始码及二进位可执行形式的权利，无论此包装是否经改作皆然：
//
// 1. 对于本软件源代码的再散播，必须保留上述的版权宣告、本条件列表，以
//    及下述的免责声明。
// 2. 对于本套件二进位可执行形式的再散播，必须连带以文件以及／或者其他附
//    于散播包装中的媒介方式，重制上述之版权宣告、本条件列表，以及下述
//    的免责声明。

// 免责声明：本软件是本软件版权持有人以及贡献者以现状（"as is"）提供，
// 本软件包装不负任何明示或默示之担保责任，包括但不限于就适售性以及特定目
// 的的适用性为默示性担保。版权持有人及本软件之贡献者，无论任何条件、
// 无论成因或任何责任主义、无论此责任为因合约关系、无过失责任主义或因非违
// 约之侵权（包括过失或其他原因等）而起，对于任何因使用本软件包装所产生的
// 任何直接性、间接性、偶发性、特殊性、惩罚性或任何结果的损害（包括但不限
// 于替代商品或劳务之购用、使用损失、资料损失、利益损失、业务中断等等），
// 不负任何责任，即在该种使用已获事前告知可能会造成此类损害的情形下亦然。
//-----------------------------------------------------------------------------
// =============================================================================
// Copyright (C) 2012-2020 长园继保自动化有限公司 All Rights Reserved
// 文件名     ：cpu_peri_uart.c
// 模块描述: DJYOS串口模块的底层驱动部分，主要实现寄存器级别的操作，如中断等
// 模块版本: V1.10
// 创建人员:
// 创建时间:
// =============================================================================
#include "stdint.h"
#include "stdio.h"
#include <stdlib.h>
#include "string.h"
#include "errno.h"
#include "systime.h"
#include "cpu_peri.h"
#include <driver/include/uart.h>
#include "int.h"
#include "djyos.h"
#include "cpu_peri_uart.h"
#include "cpu_peri_int_line.h"

#include "stm32l4xx.h"
#include "stm32l4xx_hal_uart.h"
#include <stm32l4xx_hal_rcc.h>
#define tagUartReg USART_TypeDef

extern const char *gc_pCfgStdinName;    //标准输入设备
extern const char *gc_pCfgStdoutName;   //标准输出设备
//extern const char *gc_pCfgStderrName;   //标准错误输出设备

// =============================================================================
typedef struct
{
	char* Name;
	tagUartReg volatile *Reg;
	u8 TxRxIntLine;
	u8 DmaRxIntLine;
	u8 DmaTxIntLine;
	u8 DmaReq;
	DMA_Channel_TypeDef *DmaRxCh;
	DMA_Channel_TypeDef *DmaTxCh;
}tagUartCfg;

static const tagUartCfg sUartCfg[CN_UART_NUM] = {
{"UART1",(tagUartReg volatile *)USART1_BASE,CN_INT_LINE_USART1,CN_INT_LINE_DMA1_CH5,CN_INT_LINE_DMA1_CH4,DMA_REQUEST_2,DMA1_Channel5,DMA1_Channel4},
{"UART2",(tagUartReg volatile *)USART2_BASE,CN_INT_LINE_USART2,CN_INT_LINE_DMA1_CH6,CN_INT_LINE_DMA1_CH7,DMA_REQUEST_2,DMA1_Channel6,DMA1_Channel7},
{"UART3",(tagUartReg volatile *)USART3_BASE,CN_INT_LINE_USART3,CN_INT_LINE_DMA1_CH3,CN_INT_LINE_DMA1_CH2,DMA_REQUEST_2,DMA1_Channel3,DMA1_Channel2},
{"UART4",(tagUartReg volatile *)LPUART1_BASE,CN_INT_LINE_LPUART1,CN_INT_LINE_DMA2_CH7,CN_INT_LINE_DMA2_CH6,DMA_REQUEST_4,DMA2_Channel7,DMA2_Channel6}
};
// =============================================================================

#define UART_SndBufLen    32
#define UART_RxBufLen	  32

static u32 TxByteTime;                    //正常发送一个字节所需要的时间
static UART_HandleTypeDef *PutStrDirectH;       //用于printk发送的串口
static UART_HandleTypeDef *GetCharDirectH;      //用于直接接收的串口
static u32 TxDirectPort;                  //用于printk发送的串口号
static u32 RxDirectPort;                  //用于直接接收的串口号
// =============================================================================

static struct UartCB *pUartCB[CN_UART_NUM];
static u8* pUartSndBuf[CN_UART_NUM] = {NULL};
static u8* pUartRcvBuf[CN_UART_NUM] = {NULL};
static bool_t sUartDmaUsed[] = {false,false,false,false};
static bool_t sUartSending[] = {false,false,false,false};
static u8 sDmaRcvOff[CN_UART_NUM] = {0};

static UART_HandleTypeDef sHuart[CN_UART_NUM];
static UART_HandleTypeDef *phuart[CN_UART_NUM] = {
		&sHuart[0],&sHuart[1],&sHuart[2],&sHuart[3]};


// =============================================================================
static ptu32_t UART_ISR(ptu32_t IniLine);
__weak void Board_UartHalfDuplexSend(u8 port)
{
	//user added if need out of the file
}
__weak void Board_UartHalfDuplexRecv(u8 port)
{
	//user added if need out of the file
}

static void __UART_StartRecv(u8 port)
{
	if(sUartDmaUsed[port])
	{
		sDmaRcvOff[port] = 0;
		HAL_UART_Receive_DMA(phuart[port],pUartRcvBuf[port],UART_RxBufLen);
	}
	else
	{
		HAL_UART_Receive_IT(phuart[port],pUartRcvBuf[port],1);
	}
}


static void __UART_RCC_Enable(u8 port,u8 en)
{
	if(en)
	{
	    switch(port)
	    {//使能串口1时钟
	    case CN_UART1:      __HAL_RCC_USART1_CLK_ENABLE();        break; //使能串口1时钟
	    case CN_UART2:      __HAL_RCC_USART2_CLK_ENABLE();        break;
	    case CN_UART3:      __HAL_RCC_USART3_CLK_ENABLE();        break;
	    case CN_UART4:      __HAL_RCC_LPUART1_CLK_ENABLE();        break;
	    default:
	        break;
	    }
	}
	else
	{
	    switch(port)
	    {
	    case CN_UART1:      __HAL_RCC_USART1_CLK_DISABLE();        break;
	    case CN_UART2:      __HAL_RCC_USART2_CLK_DISABLE();        break;
	    case CN_UART3:      __HAL_RCC_USART3_CLK_DISABLE();        break;
	    case CN_UART4:      __HAL_RCC_LPUART1_CLK_DISABLE();        break;
	        break;
	    default:
	        break;
	    }
	}
}
// =============================================================================
// 功能: 设置串口baud,PCLK为25M，CPU主频为216M计算,该驱动只提供9600、19200、57600、
//       115200四种波特率设置
// 参数: Reg,被操作的寄存器组指针
//       port,串口号
//       baud,波特率
// 返回: 无
// =============================================================================
static void __UART_BaudSet(u32 port,u32 baud)
{
    if(port < CN_UART_NUM)
    {
    	phuart[port]->Init.BaudRate = baud;
    	HAL_UART_Abort(phuart[port]);
    	UART_SetConfig(phuart[port]);
    	__UART_StartRecv(port);
    }
    if(TxDirectPort == port)
    {
        TxByteTime = 11000000/baud;     //1个字节传输时间，按10bit，+10%计算
    }
}

static void __UART_Start(u8 port)
{
	__UART_RCC_Enable(port,1);
	HAL_UART_Abort(phuart[port]);
	__UART_StartRecv(port);
}
static void __UART_Stop(u8 port)
{
	HAL_UART_Abort(phuart[port]);
	__UART_RCC_Enable(port,0);
}

