china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32l433/src/cpu_peri_uart.c
	}
	__UART_StartRecv(port);
}
// =============================================================================
// 功能: 串口设备的控制函数,与具体的硬件寄存器设置相关
// 参数: Reg,被操作的串口寄存器指针.
//       cmd,操作类型
//       data1,data2,含义依cmd而定
// 返回: 无意义.
// =============================================================================
static ptu32_t __UART_Ctrl(tagUartReg *Reg,u32 cmd, u32 data1,u32 data2)
{
    ptu32_t result = 0;
    u32 port;
    u32 timeout = 100000;
    for(port = CN_UART1;port < CN_UART_NUM;port ++)
    {
    	if(Reg == sUartCfg[port].Reg)
    		break;
    }
    if(port < CN_UART_NUM)
    {
        switch(cmd)
        {
        case CN_UART_START:
        	__UART_Start(port);
        	break;
        case CN_UART_STOP:
        	__UART_Stop(port);
            break;
        case CN_UART_SET_BAUD:
        	__UART_BaudSet(port,data1);
        	break;
        case CN_UART_COM_SET:
            __UART_ComConfig(Reg,port,data1);
            break;
        case CN_UART_HALF_DUPLEX_SEND: //发送数据
        	Board_UartHalfDuplexSend(port);
        	break;
        case CN_UART_HALF_DUPLEX_RECV: //接收数据
            while((HAL_UART_STATE_READY != HAL_UART_GetState(phuart[port]))
            		&& (timeout > 10))
            {
                timeout -=10;
                Djy_DelayUs(10);
            }
            Board_UartHalfDuplexRecv(port);
        	break;
        case CN_UART_DMA_USED:
            __UART_SetDmaUsed(port,1);
            break;
        case CN_UART_DMA_UNUSED:
        	__UART_SetDmaUsed(port,0);
            break;
        default:
        	break;
        }
    }
    return result;
}

// =============================================================================
// 功能：发送完成回调函数，由HAL中断函数调用，若DMA中断调用此函数，由必然是配置的传送长度
//      完成，若传送完成，需配置发送ING标记为false
// 参数：huart，HAL提供的UARTHandler
// 返回：无
// =============================================================================
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	u16 port,len;
	for(port = CN_UART1;port < CN_UART_NUM; port ++)
	{
		if(huart == phuart[port])
			break;
	}
	if(port < CN_UART_NUM)
	{
	    len = UART_PortRead(pUartCB[port],pUartSndBuf[port],UART_SndBufLen,0);
	    if(len > 0)
	    {
	    	if(sUartDmaUsed[port])
	    		HAL_UART_Transmit_DMA(phuart[port],pUartSndBuf[port],len);
	    	else
	    		HAL_UART_Transmit_IT(phuart[port],pUartSndBuf[port],len);
	    }
	    else
	    	sUartSending[port] = false;
	}
}

// =============================================================================
// 功能：接收完成回调函数，包括DMA接收完成，由HAL中断函数调用，若DMA中断调用此函数，由必然
//      是配置的传送长度完成，即下面代码中的num == UART_RxBufLen
// 参数：huart，HAL提供的UARTHandler
// 返回：无
// =============================================================================
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	u8 port,num;
	u8 *src;
	for(port = CN_UART1;port < CN_UART_NUM; port ++)
	{
		if(huart == phuart[port])
			break;
	}
	if(port < CN_UART_NUM)
	{
		if(sUartDmaUsed[port])
		{
			num = UART_RxBufLen - sDmaRcvOff[port];
			src = pUartRcvBuf[port] + sDmaRcvOff[port];
			if(num != UART_PortWrite(pUartCB[port],src,num,0))
			{
				UART_ErrHandle(pUartCB[port],CN_UART_BUF_OVER_ERR);
			}
			sDmaRcvOff[port] = 0;
		}
		else
		{
			num = UART_PortWrite(pUartCB[port],pUartRcvBuf[port],1,0);
			if(num != 1)
			{
				UART_ErrHandle(pUartCB[port],CN_UART_BUF_OVER_ERR);
			}
			HAL_UART_Receive_IT(phuart[port],pUartRcvBuf[port],1);
		}
	}
}

void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart)//半传输中断
{
	u8 port,num;
	u8 *src;
	for(port = CN_UART1;port < CN_UART_NUM; port ++)
	{
		if(huart == phuart[port])
			break;
	}
	if(port < CN_UART_NUM)
	{
		if(sUartDmaUsed[port])
		{
			num = UART_RxBufLen/2 - sDmaRcvOff[port];
			src = pUartRcvBuf[port] + sDmaRcvOff[port];
			if(num != UART_PortWrite(pUartCB[port],src,num,0))
			{
				UART_ErrHandle(pUartCB[port],CN_UART_BUF_OVER_ERR);
			}
			sDmaRcvOff[port] = UART_RxBufLen/2;
		}
		else
		{
			num = UART_PortWrite(pUartCB[port],pUartRcvBuf[port],1,0);
			if(num != 1)
			{
				UART_ErrHandle(pUartCB[port],CN_UART_BUF_OVER_ERR);
			}
			HAL_UART_Receive_IT(phuart[port],pUartRcvBuf[port],1);
		}
	}
}
// =============================================================================
// 功能：发生错误回调函数，例如发生奇偶校验错误、硬件错误等HAL会调用此函数
// 参数：huart，HAL提供的UARTHandler
// 返回：无
// =============================================================================
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	u8 port;
	for(port = CN_UART1;port < CN_UART_NUM; port ++)
	{
		if(huart == phuart[port])
			break;
	}
	if(port < CN_UART_NUM)
	{
		UART_ErrHandle(pUartCB[port],CN_UART_HARD_COMM_ERR);
		printk("Uart hard error!\r\n");
	}
}
// =============================================================================
// 功能：UART中断,若为idle中断，则从DMA缓冲区中读出数据，并重新启动DMA，否则调用HAL中断
//       处理函数，最终会调用到HAL_UART_XXXXCallback（）
// 参数：串口号
// 返回：1=成功，0=失败
// =============================================================================
u32 UART_ISR(ptu32_t port)
{
	u32 num;
    tagUartReg volatile *Reg;
    u8 *src,temp;

    if(port < CN_UART_NUM)
    {
		Reg = sUartCfg[port].Reg;
		if( (Reg->ISR & USART_ISR_IDLE) && (sUartDmaUsed[port]) )
		{
			Reg->ICR = USART_ICR_IDLECF;	//clear the status flag

			temp = UART_RxBufLen - phuart[port]->hdmarx->Instance->CNDTR;
			num =  temp -sDmaRcvOff[port];
			src = pUartRcvBuf[port] + sDmaRcvOff[port];
			if(num != UART_PortWrite(pUartCB[port],src,num,0))
			{
				UART_ErrHandle(pUartCB[port],CN_UART_BUF_OVER_ERR);
			}
			sDmaRcvOff[port] = temp;
		}
		else
		{
			HAL_UART_IRQHandler(phuart[port]);
		}
    }
    return 1;
}

// =============================================================================
// 功能：初始化uart1模块,并装载串口设备，会调用uart.c的API函数。该函数主要完成的功能
//       如下：
//       1.初始化串口的硬件部分，如GPIO、中断、配置配置的COM参数，配置baud = 115200
//         stop bits = 1,无奇偶校验, data bits = 8
//       2.调用uart.c的API函数UART_InstallPort，装入串口设备
// 参数：串口号，0~3
// 返回：1=成功，0=失败
// =============================================================================
ptu32_t ModuleInstall_UART(u32 port)
{
	bool_t Ret = false;
    struct UartParam UART_Param;

    if(port < CN_UART_NUM)
    {
		UART_Param.Name         = sUartCfg[port].Name;
		UART_Param.UartPortTag  = (ptu32_t)sUartCfg[port].Reg;
		UART_Param.Baud         = 115200;
		UART_Param.TxRingBufLen = UART_SndBufLen;
		UART_Param.RxRingBufLen = UART_RxBufLen;
		UART_Param.StartSend    = (UartStartSend)__UART_SendStart;
		UART_Param.UartCtrl     = (UartControl)__UART_Ctrl;

		pUartSndBuf[port] = (u8*)malloc(UART_SndBufLen + UART_RxBufLen);
		pUartCB[port] = UART_InstallPort(&UART_Param);
		if( ( pUartCB[port] != NULL) && (pUartSndBuf[port] != NULL) )
		{
			pUartRcvBuf[port] = pUartSndBuf[port] + UART_SndBufLen;
			__UART_HardInit(port);				//硬件初始化
			__UART_IntInit(port);
			Ret = true;
		}
    }
    return Ret;
}

